SELECT        Заказы.Наименование_товара
FROM            Заказчики INNER JOIN
                         Заказы ON Заказчики.Наименование_фирмы = Заказы.Заказчик INNER JOIN
                         Товары ON Заказы.Наименование_товара = Товары.Наименование
WHERE        (Заказы.Дата_поставки > CONVERT(DATETIME, '2020-01-01 00:00:00', 102))

SELECT        Заказы.Дата_поставки
FROM            Заказчики INNER JOIN
                         Заказы ON Заказчики.Наименование_фирмы = Заказы.Заказчик INNER JOIN
                         Товары ON Заказы.Наименование_товара = Товары.Наименование
WHERE        (Заказы.Дата_поставки > CONVERT(DATETIME, '2020-01-01 00:00:00', 102))