SELECT        Товары.Наименование
FROM            Заказчики INNER JOIN
                         Заказы ON Заказчики.Наименование_фирмы = Заказы.Заказчик INNER JOIN
                         Товары ON Заказы.Наименование_товара = Товары.Наименование
WHERE        (Товары.Цена > 100 AND Товары.Цена < 800)

SELECT        Товары.Цена
FROM            Заказчики INNER JOIN
                         Заказы ON Заказчики.Наименование_фирмы = Заказы.Заказчик INNER JOIN
                         Товары ON Заказы.Наименование_товара = Товары.Наименование
WHERE        (Товары.Цена > 100 AND Товары.Цена < 800)